my_string = input("Введите количество строк, пожалуйста! ")
print('Вы ввели', my_string, 'Поздравляем! ')

print("Введите количество строк, пожалуйста! ".upper())
print("Введите количество строк, пожалуйста! ".lower())
print("Введите количество строк, пожалуйста! ".replace(" ", ""))

print(my_string[0])
print(my_string[-1])
my_string = input("Введите количество строк, пожалуйста! ")
print('Вы ввели', my_string, 'Поздравляем! ')

print("Введите количество строк, пожалуйста! ".upper())
print("Введите количество строк, пожалуйста! ".lower())
print("Введите количество строк, пожалуйста! ".replace(" ", ""))

print(my_string[0])
print(my_string[-1])
